homework/hw2/hw2_finish/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       358900;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       359100;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       359300;
    }
    atmosphere
    {
        type            patch;
        nFaces          600;
        startFace       359900;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          360000;
        startFace       360500;
    }
    sym1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          300;
        startFace       720500;
    }
    sym2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          300;
        startFace       720800;
    }
)

// ************************************************************************* //
