homework/hw2/hw2_finish/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{    
    atmosphere
    {
      type patch;
      type	zeroGradient;

    }
    inlet
    {
      type	fixedValue;
      value	uniform (1 0 0);

    }
    outlet
    {
      type	zeroGradient;

    }
    walls
    {
      type	fixedValue;
      value	uniform (0 0 0);

    }
    frontAndBack
    {
      type	empty;

    }
    sym1
    {
      type	symmetryPlane;
    }
    sym2
    {
      type	symmetryPlane;
    }
}

// ************************************************************************* //
