homework/hw2/hw2_finish/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
      type	zeroGradient;

    }
    outlet
    {
      type	fixedValue;
      value	uniform 0;
    }
        atmosphere
    {
      type patch;
      type	zeroGradient;

    }
    walls
    {
      type	zeroGradient;
      

    }
    frontAndBack
    {
      type	empty;

    }
    sym1
    {
      type	symmetryPlane;
    }
    sym2
    {
      type	symmetryPlane;
    }
}

// ************************************************************************* //
